lua/tools/luacheck.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>luacheck</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">luacheck</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfed9160">1. 概述</a></li>
<li><a href="#orgc2193db">2. 安装</a></li>
<li><a href="#org1c9d035">3. 配置</a>
<ul>
<li><a href="#org04218d6">3.1. 命令行选项（CLI Option）</a></li>
<li><a href="#org715e38f">3.2. 配置文件选项(ConfigureFile Option)</a></li>
<li><a href="#org38ce52c">3.3. 内联选项(Inline Option)</a></li>
<li><a href="#org63b287b">3.4. 常见选项</a>
<ul>
<li><a href="#orgfaa0e15">3.4.1. 全局变量（1xx）</a>
<ul>
<li><a href="#orgfc099d2">3.4.1.1. std</a></li>
</ul>
</li>
<li><a href="#orgcaaf2f3">3.4.2. 隐式定义的全局变量</a></li>
<li><a href="#orgd98a203">3.4.3. 模块</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3a4dab9">4. 使用</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfed9160" class="outline-2">
<h2 id="orgfed9160"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
luacheck 是一个静态分析器和 linter。luacheck 可以检测各种问题，例如使用未定义的全局变量、未使用的变量和值、访问未初始化的变量、无法访问的代码等等。
</p>

<p>
luacheck 支持使用 Lua 5.1，Lua 5.2，Lua 5.3 和 LuaJIT 的语法检查 Lua 文件。luacheck 本身是用 Lua 编写的，并且运行在所有提到的 Lua 版本上。
</p>

<p>
luacheck 还可以通过 LuaLanes 并行检查，提高检查速度
</p>
</div>
</div>

<div id="outline-container-orgc2193db" class="outline-2">
<h2 id="orgc2193db"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">luarocks install luacheck
luarcoks install lanes
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c9d035" class="outline-2">
<h2 id="org1c9d035"><span class="section-number-2">3</span> 配置</h2>
<div class="outline-text-2" id="text-3">
<p>
检查的大多数方面都是可配置的：用于定义自定义项目相关全局变量的选项，用于选择标准全局变量集（Lua 标准库的版本），用于按类型和相关变量名称过滤警告等。
</p>
</div>

<div id="outline-container-org04218d6" class="outline-3">
<h3 id="org04218d6"><span class="section-number-3">3.1</span> 命令行选项（CLI Option）</h3>
<div class="outline-text-3" id="text-3-1">
<p>
luacheck 尝试从当前目录中的 <code>.luacheckrc</code> 文件加载配置。如果没有找到，它将在父目录中查找它，依此类推，直到它到达文件系统根目录。可以使用 <code>--config</code> 选项设置 config 的路径，在这种情况下，它将在递归加载期间使用。配置中的路径相对于加载目录进行解释。
</p>

<p>
可以使用 &#x2013;no-config 标志禁用配置加载。
</p>
</div>
</div>

<div id="outline-container-org715e38f" class="outline-3">
<h3 id="org715e38f"><span class="section-number-3">3.2</span> 配置文件选项(ConfigureFile Option)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
如果未使用 <code>--config</code> 、 <code>-no-config</code> 和 <code>--no-default-config</code> 选项，则 luacheck 将尝试从 <code>--default-config</code> 选项或 <code>％LOCALAPPDATA％\luacheck\.luacheckrc</code> 的值加载配置（在 Windows 上）， <code>~/Library/Application Support/luacheck/.luacheckrc</code> （OS X/macOS 上），以及其他系统上的 <code>$XDG_CONFIG_HOME/luacheck/.luacheckrc</code> 或 <code>~/.config/luacheck/.luacheckrc</code> 默认情况下。默认配置中的路径相对于当前目录进行解释。
</p>

<p>
配置只是 luacheck 执行的 Lua 脚本。它可以通过赋值全局变量或通过返回带有选项名称作为键的表来设置各种选项。
</p>

<p>
从配置文件加载的选项具有最低优先级：可以使用 CLI 选项或内联选项覆盖它们。
</p>

<p>
其他详见 <a href="https://luacheck.readthedocs.io/en/stable/config.html">luacheck 文档</a> 。
</p>
</div>
</div>


<div id="outline-container-org38ce52c" class="outline-3">
<h3 id="org38ce52c"><span class="section-number-3">3.3</span> 内联选项(Inline Option)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
luacheck 支持在已检查的文件中使用内联配置注释直接设置一些选项。这些内联选项具有最高优先级，覆盖配置选项和 CLI 选项。
</p>

<p>
内联配置注释是一个以 <code>luacheck</code> 标记开头的简短注释，可位于空格之后。注释的主体应包含逗号分隔选项，其中选项由其名称和空格分隔的参数组成。它还可以包含用括号括起来的注释，这些注释将被忽略。
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">luacheck: globals g1 g2, ignore foo</span>
<span style="color: #a1db00;">local</span> <span style="color: #ff8700;">foo</span> = g1(g2) <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">No warnings emitted.</span>

<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">The following unused function is not reported.</span>
<span style="color: #a1db00;">local</span> <span style="color: #a1db00;">function</span> <span style="color: #ffd700;">f</span>() <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">luacheck: ignore</span>
   <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">luacheck: globals g3</span>
   g3() <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">No warning.</span>
<span style="color: #a1db00;">end</span>

g3() <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">Warning is emitted as the inline option defining g3 only affected function f.</span>
</pre>
</div>

<p>
不带参数的选项可以带有前缀，以反转其含义。例如，使用 <code>--luacheck: no unused args</code> 禁用未使用的参数警告。
</p>

<p>
要对内联选项可见性进行细粒度控制，请使用 <code>luacheck:push</code> 和 <code>luacheck:pop</code> 指令：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">luacheck: push ignore foo</span>
foo() <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">No warning.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">luacheck: pop</span>
foo() <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">Warning is emitted.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org63b287b" class="outline-3">
<h3 id="org63b287b"><span class="section-number-3">3.4</span> 常见选项</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orgfaa0e15" class="outline-4">
<h4 id="orgfaa0e15"><span class="section-number-4">3.4.1</span> 全局变量（1xx）</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
对于每个文件，Luacheck 构建了可在此处使用的已定义全局变量和字段的列表。 默认情况下，只定义 Lua 标准库中的全局变量;  可以使用 <code>--globals</code> CLI 选项或 <code>globals</code> 配置选项添加自定义全局变量，并且可以使用 <code>--std</code> CLI 选项或 <code>std</code> 配置文件选项选择标准库的版本。 当设置，修改或访问未定义的全局或字段时，Luacheck 会发出警告。
</p>
</div>

<div id="outline-container-orgfc099d2" class="outline-5">
<h5 id="orgfc099d2"><span class="section-number-5">3.4.1.1</span> std</h5>
<div class="outline-text-5" id="text-3-4-1-1">
<p>
可以通过改变全局 stds 变量为自定义集命名，以便可以在 <code>-std</code> CLI 选项和 <code>std</code> inline 和 配置文件选项中使用它们。
</p>
</div>
</div>
</div>

<div id="outline-container-orgcaaf2f3" class="outline-4">
<h4 id="orgcaaf2f3"><span class="section-number-4">3.4.2</span> 隐式定义的全局变量</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
Luacheck 可以设置为在某些条件下赋值的全局变量是被隐式定义的。 当使用 <code>-d/-allow_defined</code> CLI 选项或 <code>allow_defined</code> 配置文件选项时，对 globals 的所有赋值都会定义它们;  当使用 <code>-t/-allow_defined_top</code> CLI 选项或 <code>allow_defined_top</code> 配置文件选项时，顶级函数范围（也称为主块）中的全局变量的赋值定义它们。未被访问的隐式定义的全局变量会产生警告。
</p>
</div>
</div>

<div id="outline-container-orgd98a203" class="outline-4">
<h4 id="orgd98a203"><span class="section-number-4">3.4.3</span> 模块</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
可以使用 <code>-m/-module</code> CLI 选项或 module 配置文件选项将文件标记为模块，以模拟不推荐使用的 module 功能的语义。 隐含在模块内部定义的 Globals 是其接口的一部分，在外部不可见，并且不会报告为未使用。不允许对其他全局变量进行赋值，即使是已定义的全局变量。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org3a4dab9" class="outline-2">
<h2 id="org3a4dab9"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
<p>
安装 luacheck 后，从命令行运行 luacheck 程序。传递一个文件列表，rockspecs 或目录（需要 LuaFileSystem）来检查：
</p>
<div class="org-src-container">
<pre class="src src-sh">luacheck src extra_file.lua another_file.lua
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:34</p>
<p class="validation"></p>
</div>
</body>
</html>
